In [20]:
import pandas as pd
import numpy as np
df=pd.read_csv("datasets/students.csv")
df

    Name SRN  Mark1 Mark2  Mark3 Target
0   Ajay  11   88.0     ?     70   Fail
1   Kira  22   98.0     ?     71   Pass
2   Rama  33  100.0     ?     67   Pass
3  Peter  44    NaN     ?     78   Fail
4   John   ?    NaN    88     89   Fail
5   Adam  88   78.0    90     97   Pass
6   Ravi  66   90.0    90     10   Fail

In [21]:
print(df.isin(['?']))
df.isin(["?"]).sum()

    Name    SRN  Mark1  Mark2  Mark3  Target
0  False  False  False   True  False   False
1  False  False  False   True  False   False
2  False  False  False   True  False   False
3  False  False  False   True  False   False
4  False   True  False  False  False   False
5  False  False  False  False  False   False
6  False  False  False  False  False   False

Name      0
SRN       1
Mark1     0
Mark2     4
Mark3     0
Target    0
dtype: int64

In [22]:
df["SRN"]=df["SRN"].replace('?',np.nan)
df["Mark2"]=df["Mark2"].replace('?',np.nan)
df

    Name  SRN  Mark1 Mark2  Mark3 Target
0   Ajay   11   88.0   NaN     70   Fail
1   Kira   22   98.0   NaN     71   Pass
2   Rama   33  100.0   NaN     67   Pass
3  Peter   44    NaN   NaN     78   Fail
4   John  NaN    NaN    88     89   Fail
5   Adam   88   78.0    90     97   Pass
6   Ravi   66   90.0    90     10   Fail

In [23]:
# df.dropna or fillna
df=df.fillna(5)
df

    Name SRN  Mark1 Mark2  Mark3 Target
0   Ajay  11   88.0     5     70   Fail
1   Kira  22   98.0     5     71   Pass
2   Rama  33  100.0     5     67   Pass
3  Peter  44    5.0     5     78   Fail
4   John   5    5.0    88     89   Fail
5   Adam  88   78.0    90     97   Pass
6   Ravi  66   90.0    90     10   Fail

In [24]:
df.shape

(7, 6)

In [25]:
df.columns

Index(['Name', 'SRN', 'Mark1', 'Mark2', 'Mark3', 'Target'], dtype='object')

In [26]:
df.columns[2]

'Mark1'

# Label Encoder

In [27]:
import pandas as pd
from sklearn.preprocessing import  LabelEncoder
y=pd.read_csv("datasets/demo.csv")
print(y)
y["Target"]=LabelEncoder().fit_transform(y["Target"])
y

  Target
0  <=50k
1   >50k

   Target
0       0
1       1

In [28]:
import pandas as pd
from sklearn.preprocessing import  LabelEncoder
y=pd.read_csv("datasets/demo.csv")
print(y)
y=LabelEncoder().fit_transform(y)
# y=pd.Dateframe(y)
print(y)
y=pd.DataFrame(y)
y

  Target
0  <=50k
1   >50k
[0 1]

c:\Users\LOKESH\AppData\Local\Programs\Python\Python310\lib\site-packages\sklearn\preprocessing\_label.py:114: DataConversionWarning: A column-vector y was passed when a 1d array was expected. Please change the shape of y to (n_samples, ), for example using ravel().
  y = column_or_1d(y, warn=True)

   0
0  0
1  1

In [29]:
3.0+2.0

5.0